////1. Число

/*
    313103
    1/0 - Infinity
    -1/0 - -Infinity
    "рр"/ 5 - NaN

*/

///2. BigInt

/*
    O284249n

*/

///3. String

/*

В JavaScript существует три типа кавычек.

Двойные кавычки: "Привет".
Одинарные кавычки: 'Привет'.
Обратные кавычки: `Привет`.

*/

//4 Булевый (логический) тип

/*

    Булевый тип (boolean) может принимать только два значения: true (истина) и false (ложь).

Такой тип, как правило, используется для хранения значений да/нет: true значит «да, правильно», а false значит «нет, не правильно».

*/

//5. Значение «null»

//6. Значение «undefined»

//7. Объекты и символы

//1. Строковое преобразование

console.log(String(null));
